abstract class WeighSerialConfig {
  // 称重的通信比特率
  static int baudRate = 9600;

  // 通过 vId - pId 筛选称重设备
  static Map<int, List<int>> weighDeviceList = {
    1027: [
      24577,
      24592,
      24593,
      24596,
      24597,
    ],
    4292: [
      60000,
      60016,
      60017,
    ],
    1659: [
      8963,
      9123,
      9139,
      9155,
      9171,
      9187,
      9203,
    ],
    6790: [
      21795,
      29987,
      21972,
    ],
    9025: [],
    5824: [1155],
    1003: [8260],
    7855: [4],
    3368: [516],
    1155: [22336],
    11914: [
      5,
      10,
    ],
  };
}
